// Motion Pattern
// スプライトアニメーションの指定
// 
// MP NO.(モーションパターン番号）
// Wait Flame Time（アニメーションの間）フレームで指定
// Loop step (loop end number)　最小は0（アニメーションさせない）
// Sp no.,Mirror,Radian
// アニメパターンは最大で10パターンまでで
//  Mirror and Radian -1 -> Object data
//   1:上下反転　2:左右反転
//  Mirror and Radian -1 -> Object data
//　オブジェクトの持つラジアン値を使用する。
//
function motionPattern(){

	var mp = [];

	var no = 0;
	
	mp[no] = {};

	mp[no].wait = 0;
	//Boolean(mp[no].wait) = true = wait on;
	mp[no].pattern = [
	 ["Space", 0, 0 ]];
//===================================

	//mayura 右向き
	//=================================================
	no = 1;

	mp[no] = {};

	mp[no].wait = 18;
	mp[no].pattern = [
	["Mayura1", 0, 0],
	["Mayura2", 0, 0],
	["Mayura3", 0, 0],
	["Mayura4", 0, 0]
    ];

	//mayura 左向き
	//=================================================
	no = 2;

	mp[no] = {};

	mp[no].wait = 18;
	mp[no].pattern = [
	["Mayura1", 2, 0],
	["Mayura2", 2, 0],
	["Mayura3", 2, 0],
	["Mayura4", 2, 0]
    ];

	//ENEMY
	//=================================================
	no = 4;

	mp[no] = {};

	mp[no].wait = 18;
	mp[no].pattern = [
	["Unyuu1", 0, 0],
	["Unyuu2", 0, 0]
    ];

	//ENEMY
	//=================================================
	no = 5;

	mp[no] = {};

	mp[no].wait = 18;
	mp[no].pattern = [
	["Unyuu1", 2, 0],
	["Unyuu2", 2, 0]
    ];

	//青弾
	//=================================================
	no = 7;

	mp[no] = {};

	mp[no].wait = 18;
	mp[no].pattern = [
     ["Fire1", 0, 0],
	 ["Fire2", 0, 0]];
	/*
	mp[no].wait = 10;
	mp[no].pattern = [
    ["Ball1", 0, 0],
    ["Ball2", 0, 0],
    ["Ball3", 0, 0],
    ["Ball2", 0, 0]
    ];
	*/
	//爆発
	//=================================================
	no = 12;

	mp[no] = {};

	mp[no].wait = 10;
	mp[no].pattern = [
    ["Down5", 0, 0],
    ["Down4", 0, 0],
    ["Down3", 0, 0],
    ["Down2", 0, 0],
    ["Down1", 0, 0],
    ["Down2", 0, 0],
    ["Down3", 0, 0],
    ["Down4", 0, 0],
    ["Down5", 0, 0]
    ];

	//爆発(Hit)
	//=================================================
	no = 11;

	mp[no] = {};

	mp[no].wait = 15;
	mp[no].pattern = [
    ["Zap1", 0, 0],
    ["Zap2", 0, 0],
    ["Zap3", 0, 0],
    ["Zap4", 0, 0]
    ];

	//Ball
	//=================================================
	no = 26;

	mp[no] = {};

	mp[no].wait = 10;
	mp[no].pattern = [
    ["Ball1", 0, 0],
    ["Ball2", 0, 0],
    ["Ball3", 0, 0],
    ["Ball2", 0, 0]
    ];

	//key
	//=================================================
	no = 27;

	mp[no] = {};

//	mp[no].wait = 20;
	mp[no].pattern = [
	["Key", 0, 0]
    ];

	//B
	//=================================================
	no = 28;

	mp[no] = {};

	mp[no].wait = 10;
	mp[no].pattern = [
    ["BallB1", 0, 0],
    ["BallB2", 0, 0],
    ["BallB3", 0, 0],
    ["BallB2", 0, 0]
    ];

	//S
	//=================================================
	no = 29;

	mp[no] = {};

	mp[no].wait = 10;
	mp[no].pattern = [
    ["BallS1", 0, 0],
    ["BallS2", 0, 0],
    ["BallS3", 0, 0],
    ["BallS2", 0, 0]
    ];

	//L
	//=================================================
	no = 30;

	mp[no] = {};

	mp[no].wait = 10;
	mp[no].pattern = [
    ["BallL1", 0, 0],
    ["BallL2", 0, 0],
    ["BallL3", 0, 0],
    ["BallL2", 0, 0]
    ];
	//L
	//=================================================
    no = 31;

	mp[no] = {};

	mp[no].pattern = [
	["Unyuu3", 0, 0]
    ];
	//Coin
	//=================================================
	no = 32;

	mp[no] = {};

	mp[no].wait = 5;
	mp[no].pattern =
	[["Coin1", 0, 0]
	, ["Coin2", 0, 0]
	, ["Coin3", 0, 0]
	, ["Coin4", 0, 0]
	, ["Coin3", 2, 0]
	, ["Coin2", 2, 0]
	, ["Coin1", 2, 0]];

	//=================================================
	no = 15;

	mp[no] = {};

	mp[no].pattern = [
	["Knife", -1, -1]
    ];

	//=================================================
	no = 33;

	mp[no] = {};

	mp[no].pattern = [
	["Lamp", 0, 0]
    ];
	//=================================================
	no = 34;

	mp[no] = {};

	mp[no].pattern = [
	["Map", 0, 0]
    ];
	//=================================================
	no = 35;

	mp[no] = {};

	mp[no].pattern = [
	["Spear", -1, -1]
    ];
	//=================================================
	no = 36;

	mp[no] = {};

	mp[no].pattern = [
	["Boom", -1, -1]
    ];

	//=================================================
	no = 37;

	mp[no] = {};

	mp[no].pattern = [
	["Axe", -1, -1]
    ];

	//=================================================
	no = 38;

	mp[no] = {};

	mp[no].pattern = [
	["Wand", -1, -1]
    ];

	//=================================================
	no = 39;

	mp[no] = {};

	mp[no].pattern = [
	["TrBox", 0, 0]
    ];

	//=================================================
	no = 40;

	mp[no] = {};

	mp[no].pattern = [
	["Baxe", -1, -1]
    ];

	//=================================================
	no = 41;

	mp[no] = {};

	mp[no].pattern = [
	["Rod", -1, -1]
    ];

	//=================================================
	no = 42;

	mp[no] = {};

	mp[no].pattern = [
	["Sword", -1, -1]
    ];

	//
	//=================================================
	no = 43;

	mp[no] = {};

	mp[no].pattern = [
	["Bow", -1, -1]
    ];

	//
	//=================================================
	no = 44;

	mp[no] = {};

	mp[no].pattern = [
	["Arrow", -1, -1]
    ];

	//InfoCursor
	//=================================================
	no = 45;

	mp[no] = {};

	mp[no].wait = 10;
	mp[no].pattern = [
    ["Cursor1", -1, -1],
    ["Cursor2", -1, -1],
    ["Cursor3", -1, -1],
    ["Cursor2", -1, -1]
];

	//
//@@
	return mp;
}